{"config": [{"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "conv2d_1", "bias_regularizer": null, "batch_input_shape": [null, 1, 10, 10], "bias_constraint": null, "filters": 10, "trainable": true, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "padding": "same", "data_format": "channels_first", "kernel_size": [2, 2], "activation": "tanh"}, "class_name": "Conv2D"}, {"config": {"pool_size": [1, 1], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "same", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv2d_2", "activation": "tanh", "bias_constraint": null, "filters": 10, "trainable": true, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "padding": "same", "data_format": "channels_first", "kernel_size": [2, 2]}, "class_name": "Conv2D"}, {"config": {"pool_size": [1, 1], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "same", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax", "units": 4, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}