{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [2, 2], "trainable": true, "filters": 10, "activation": "tanh", "kernel_constraint": null, "batch_input_shape": [null, 1, 10, 10], "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "data_format": "channels_first", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "trainable": true, "pool_size": [1, 1]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.1}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [2, 2], "trainable": true, "activation": "tanh", "filters": 10, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "data_format": "channels_first", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "trainable": true, "pool_size": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "units": 4, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "softmax", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1"}}], "backend": "tensorflow", "keras_version": "2.0.8"}